Revit 2026 API

# ModelTextHorizontalAlignment Property

---

The horizontal alignment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HorizontalAlign HorizontalAlignment { get; set; }
```
```vb
Public Property HorizontalAlignment As HorizontalAlign
	Get
	Set
```
```cpp
public:
property HorizontalAlign HorizontalAlignment {
	HorizontalAlign get ();
	void set (HorizontalAlign value);
}
```
```fsharp
member HorizontalAlignment : HorizontalAlign with get, set
```

#### Property Value

HorizontalAlign

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when an invalid value is assigned to the property. |

#### Reference

ModelText Class

Autodesk.Revit.DB Namespace